# vars_for_spss_0318
"""
SNS=学生题目序号；
TypeS=学生类型，单选0，多选1
ItemNS=学生选项个数
InNS=学生输入变量数
VarS=学生最终录入的变量

SNT=教师题目序号；
TypeT=教师类型，单选0，多选1
ItemNT=教师选项个数
InNT=教师输入变量数
VarT=教师最终录入的变量
"""
# 学生变量计算与生成
SNS   =[1,	2,	3,	4,	5,	6,	7,	8,	9,	10,	11,	12,	13,	14,	15,	16,	17,	18,	19,	20,	21]
TypeS =[0,	0,	0,	0,	1,	0,	1,	1,	0,	1,	1,	0,	0,	1,	1,	0,	0,	0,	0,	0,	0]
ItemNS=[4,	4,	5,	4,	6,	5,	7,	6,	5,	7,	3,	5,	5,	6,	6,	4,	3,	2,	4,	3,	2]
InNS  =[1,	1,	1,	1,	6,	1,	7,	6,	1,	7,	3,	1,	1,	6,	6,	1,	1,	1,	1,	1,	1]
# 计算变量总数，新建列表，内含相应数目自然数元素
VarS=list(range(1,sum(InNS)+1))
# 计数归零
i=0
# 外层循环，按学生问卷题目序号
for m in SNS:
	# 取对应题目选项个数
	TmpN=InNS[m-1]
	# 内层循环，按选项个数
	for n in range(0,TmpN):		
		# 在对应题目序号下，生成选项个数那么多的变量
		VarS[i]=m*100+(n+1)
		# 计数加1，指向下一个变量
		i=i+1
print(VarS)
# 教师变量计算与生成
SNT   =[1,	2,	3,	4,	5,	6,	7,	8,	9,	10,	11,	12,	13,	14,	15,	16,	17,	18,	19,	20,	21,	22,	23,	24]
TypeT =[0,	0,	0,	0,	0,	1,	0,	1,	0,	1,	1,	1,	1,	0,	1,	1,	1,	0,	1,	0,	1,	0,	1,	0]
ItemNT=[4,	5,	5,	7,	5,	5,	5,	7,	3,	7,	5,	5,	6,	4,	7,	4,	6,	2,	4,	2,	4,	2,	4,	4]
InNT  =[1,	1,	1,	1,	1,	5,	1,	7,	1,	7,	5,	5,	6,	1,	7,	4,	6,	1,	4,	1,	4,	1,	4,	1]

# 计算变量总数，新建列表，内含相应数目自然数元素
VarT=list(range(1,sum(InNT)+1))
# 计数归零
i=0
# 外层循环，按教师问卷题目序号
for m in SNT:
	# 取对应题目选项个数
	TmpN=InNT[m-1]
	# 内层循环，按选项个数
	for n in range(0,TmpN):
		# 在对应题目序号下，生成选项个数那么多的变量		
		VarT[i]=m*100+(n+1)
		# 计数加1，指向下一个变量
		i=i+1
print(VarT)